blog/blog.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-13 dom 22:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Un blog minimalista</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/main.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Un blog minimalista</h1>
<p>
¿Cuándo se volvió tan complicado tener un blog? Es decir, para tener una simple página donde publicar al mundo requiere una base de datos, un servidor web, código, plugins, etcétera. 
</p>

<p>
Es cierto que siempre has podido hacer una página simple, pero ¿quién en su sano juicio escribe HTML puro?, ni que estuviésemos en la época de las cavernas.
</p>

<p>
Este es un intento de quitar todas esas complicaciones y volver a lo básico: <b>Texto plano</b>
</p>

<div id="outline-container-org3a26bd4" class="outline-2">
<h2 id="org3a26bd4"><span class="section-number-2">1.</span> La idea</h2>
<div class="outline-text-2" id="text-1">
<p>
Hace ya algo de tiempo que conoczco EMACS, un editor de texto que tiene implementado algo llamado <i>org-mode</i>.
</p>

<p>
Emacs es muy conocido por ser uno de los editores de texto más viejos que se siguen usado y que además fue creado por el mismo Richard Stallman, el creador de la Free Software Foundation y las licencias GPL. 
</p>

<p>
Org-mode es uno de los modos en los que puedes usar emacs. Te permite organizar y darle seguimiento a tus tareas. Llevar tu agenda, registrar el tiempo que te lleva realizar cada tarea y hasta generar una tabla con un informe de cuánto tiempo has invertido en cada una de ellas.
</p>

<p>
En fin, otra de las grandes virtudes de org mode es que puedes exportar un documento a múltiples formatos: Latex, PDF, Markdown y&#x2026; <b>¡HTML!</b>
</p>

<p>
La idea detrás de org-mode es que siempre escribimos texto estructurado y jerarquizado. Si lo piensas un poco, te darás cuenta que esto casi siempre se cumple e incluso e difícil pensar en contraejemplos. Si tienes el texto estructurado y el formato de un archivo es otra estructura; el proceso de exportar un archivo para org mode es tan simple como pasar un archivo de una estructura a otra. 
</p>

<p>
Utilizaremos este principio para exportar archivos org a archivos html y construir nuestro blog. 
</p>
</div>
</div>
<div id="outline-container-org5f3c55a" class="outline-2">
<h2 id="org5f3c55a"><span class="section-number-2">2.</span> La práctica</h2>
<div class="outline-text-2" id="text-2">
<p>
Primero lo primero: <b>instala emacs</b>. Dependiendo de tu sistema operativo o distribución, las instrucciones son diferentes. Así que lo mejor será que gogglees las instrucciones de instalación.
</p>

<p>
Te recomiendo enormemente que, cuando agarres confianza, lo compiles; funciona mucho más rápido de esta forma.
</p>

<p>
En fin, una vez instalado podrás crear tu primer archivo de tipo org. Emacs tiene implementado esto por default así que si quieres activar este modo únicamente tienes que abrir o crear un buffer con la extensión <i>.org</i>. 
</p>
</div>
</div>

<div id="outline-container-orga3baf04" class="outline-2">
<h2 id="orga3baf04"><span class="section-number-2">3.</span> Otros recursos</h2>
<div class="outline-text-2" id="text-3">
<p>
Cuando tengas tiempo puedes visitar este video de alguien explicando org-mode:
</p>


<div class="video-responsive">
<iframe src="https://www.youtube.com/embed/SzA2YODtgK4" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
</div>
</div>
</div>
</div>
</body>
</html>
